{
  "Type": "The type of IoT device, e.g., sensor, actuator, gateway.",
  "SKU": "A unique identifier or SKU for each IoT device.",
  "Name": "The name or title of the IoT device.",
  "Published": "Indicates whether the IoT device is active (1 for yes, 0 for no).",
  "Is Featured": "A flag to highlight important IoT devices (1 for yes, 0 for no).",
  "Short Description": "A brief description of the IoT device.",
  "Description": "A detailed description of the IoT device and its capabilities.",
  "Date Sale Price Starts": "Start date for any special pricing or promotions.",
  "Date Sale Price Ends": "End date for special pricing or promotions.",
  "Tax Status": "The tax status of the device, e.g., taxable or tax-exempt.",
  "Tax Class": "The tax class assigned to the IoT device for tax calculation purposes.",
  "In Stock": "Indicates whether the device is available (1 for yes, 0 for no).",
  "Stock": "Current stock quantity of the IoT device.",
  "Backorders Allowed": "Indicates whether backorders are allowed (1 for yes, 0 for no).",
  "Sold Individually": "Specifies if the device can be purchased individually (1 for yes, 0 for no).",
  "Weight (lbs)": "The weight of the device in pounds.",
  "Length (in)": "The length of the device in inches.",
  "Width (in)": "The width of the device in inches.",
  "Height (in)": "The height of the device in inches.",
  "Allow Customer Reviews": "Whether customer reviews are allowed for the device (1 for yes, 0 for no).",
  "Purchase Note": "Additional notes or instructions for purchasers.",
  "Sale Price": "The sale price of the IoT device.",
  "Regular Price": "The regular (non-sale) price of the IoT device.",
  "Categories": "Categories or groups to which the IoT device belongs.",
  "Tags": "Tags associated with the IoT device for easy categorization.",
  "Shipping Class": "The shipping class associated with the IoT device for shipping calculations.",
  "Images": "URLs to images of the IoT device for visual representation.",
  "Download Limit": "Limit for digital downloads (if applicable).",
  "Download Expiry Days": "Expiry period for digital downloads (if applicable).",
  "Parent": "If it's a variation, it may reference a parent IoT device.",
  "Grouped Products": "IoT devices that are grouped together or sold as a set.",
  "Upsells": "IoT devices that are recommended as upsells for customers.",
  "Cross-sells": "IoT devices that are offered as cross-sell alternatives to customers.",
  "External URL": "An external URL for more information on the IoT device.",
  "Button Text": "Text for the button that links to the IoT device or its details.",
  "Position": "The position or order of the IoT device in lists or categories.",
  "Attribute Columns": "Attribute columns for IoT devices typically include specifications like color, size, power requirements, and other relevant characteristics. These attributes help describe and categorize the devices, making it easier for customers to find the right products for their needs. For example, a temperature sensor might have attributes like 'Measurement Range,' 'Accuracy,' and 'Communication Protocol,' while a smart camera might have attributes like 'Resolution,' 'Field of View,' and 'Connectivity Options.' Attribute columns can vary widely depending on the specific IoT device and its intended use."
}
